TrainBookingWS/signup.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:gs="http://localhost/train/booking">
   <soapenv:Header />
   <soapenv:Body>
      <gs:signUpRequest>
         <gs:firstName>Abc</gs:firstName>
         <gs:lastName>Def</gs:lastName>
         <gs:email>Hij</gs:email>
         <gs:password>Klm</gs:password>
         <gs:birthDate>2000-01-01</gs:birthDate>
      </gs:signUpRequest>

   </soapenv:Body>

</soapenv:Envelope>